ИСПП/src/Documents/ЗаявкаПредприятия/ЗаявкаПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаПредприятия</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияКДоговору</name>
    <type>
      <types>DocumentRef.СпецификацияКДоговору</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/Enums/СтатусыСпецификацийКДоговорам/СтатусыСпецификацийКДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификацийКДоговорам</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/Documents/СпецификацияКДоговору/СпецификацияКДоговору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпецификацияКДоговору</name>
  <basedOn>Document.ПроектЗадания</basedOn>
  <basedOn>Document.ЗаявкаПредприятия</basedOn>
  <basedOn>Document.ГЗ</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ИсполнениеЗаявокПредприятий</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектЗадания</name>
    <type>
      <types>DocumentRef.ПроектЗадания</types>
      <types>DocumentRef.ГЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификацийКДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураПоЗаявкамПредприятий</name>
    <attributes>
      <name>ЗаявкаПредприятия</name>
      <type>
        <types>DocumentRef.ЗаявкаПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗаявкиПредприятий</name>
    <attributes>
      <name>ЗаявкаПредприятия</name>
      <type>
        <types>DocumentRef.ЗаявкаПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/Documents/ЗаявкаПредприятия/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзExcelЗаверешение", ЭтотОбъект);	
	
ПоказатьВопрос(ОписаниеОповещения,"Табличная часть будет очищена! Вы уверены что хотите продолжить?", РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelЗаверешение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеПодбораТовара", ЭтотОбъект);	
		ОткрытьФорму("Документ.ЗаявкаПредприятия.Форма.ФормаЗагрузкаИзExcel",,,,,, ОповещениеОЗакрытии);	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораТовара(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ПослеПодбораТовараНаСервере(Результат);
		Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеПодбораТовараНаСервере(Результат)
	Объект.Товары.Загрузить(ПолучитьИзВременногоХранилища(Результат));
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСпецификацию(Команда)
	
    Если НЕ ЗначениеЗаполнено(Объект.СпецификацияКДоговору) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Не заполнена спцеификация!");
		Возврат;	
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСпецификациюЗавершение", ЭтотОбъект);
	
	ТекущийСтатусСпецификации = ПолучитьСтатусСпецификации(Объект.СпецификацияКДоговору); 
	
	Если  ТекущийСтатусСпецификации <> ПредопределенноеЗначение("Перечисление.СтатусыСпецификацийКДоговорам.НеСогласован") Тогда
		ТекстВопроса = "Внимание! Спецификация в статусе """ + ТекущийСтатусСпецификации + """, вы уверены что хотите продолжить?";
	Иначе
		ТекстВопроса = "Внимание! Спецификация будет обновлена, вы уверены что хотите продолжить?";
	КонецЕсли;
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпецификациюЗавершение (Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьСпецификациюНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервереБезКонтекста 
Функция ПолучитьСтатусСпецификации(Специфкация)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Специфкация, "Статус"); 
КонецФункции	

&НаСервере
Процедура ОбновитьСпецификациюНаСервере()

	СпецификацияКДоговору = Объект.СпецификацияКДоговору;
	
	//Получим текущие товары в составе спецификации по текущей заявке
	
	ТаблицаТоваровВнутриСпецификации = ПолучитьТоварыВСпецификацииПоЗаявке(СпецификацияКДоговору, Объект.Ссылка);
	
	ТаблицаРазниц = Объект.Товары.Выгрузить();
	
	Для Каждого СтрокаТовар Из ТаблицаРазниц Цикл
		
		СтрокаТовараВНутриСпецификации = ТаблицаТоваровВнутриСпецификации.Найти(СтрокаТовар.Номенклатура);
		
		Если СтрокаТовараВНутриСпецификации <> Неопределено Тогда
			СтрокаТовар.Количество = СтрокаТовар.Количество - СтрокаТовараВНутриСпецификации.Количество; 	
		КонецЕсли;	
		
	КонецЦикла;
	
	//Изменим спецификацию
	
	ДокСпецификация = СпецификацияКДоговору.ПолучитьОбъект();
	
	ТоварыСпецификации = ДокСпецификация.Товары.Выгрузить();
	
	Для Каждого СтрокаТаблицыРазниц Из ТаблицаРазниц Цикл
		НоваяСтрокаСпецификации = ТоварыСпецификации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСпецификации, СтрокаТаблицыРазниц);
		НоваяСтрокаСпецификации.ЕдиницаИзмерения = НоваяСтрокаСпецификации.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрокаСпецификации.СтавкаНДС = НоваяСтрокаСпецификации.Номенклатура.СтавкаНДС;
	КонецЦикла;
	
	ТоварыСпецификации.Свернуть("НоменклатураПоставщика, Номенклатура, ЕдиницаИзмерения, Штрихкод, СтавкаНДС", "Количество");
	
	МассивКУдалению = Новый Массив;
	
	Для Каждого СтрокаТч Из ДокСпецификация.НоменклатураПоЗаявкамПредприятий Цикл
		Если СтрокаТЧ.ЗаявкаПредприятия = Объект.Ссылка Тогда
			МассивКУдалению.Добавить(СтрокаТч);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаУдаления ИЗ МассивКУдалению Цикл
		ДокСпецификация.НоменклатураПоЗаявкамПредприятий.Удалить(СтрокаУдаления);		
	КонецЦикла;	
	
	ДокСпецификация.Товары.Загрузить(ТоварыСпецификации);
	
	ТаблицаНоменклатураПоЗаявкамПредприятий = Объект.Товары.Выгрузить();
	
	Для Каждого СтрокаТабНом ИЗ ТаблицаНоменклатураПоЗаявкамПредприятий Цикл
		НоваяСтрока = ДокСпецификация.НоменклатураПоЗаявкамПредприятий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабНом);
		НоваяСтрока.ЗаявкаПредприятия = Объект.Ссылка;
	КонецЦикла;	
	
	ДокСпецификация.Записать();
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьТоварыВСпецификацииПоЗаявке(СпецификацияКДоговору, ЗаявкаПредприятия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпецификацияКДоговоруНоменклатураПоЗаявкамПредприятий.ЗаявкаПредприятия КАК ЗаявкаПредприятия,
	|	СпецификацияКДоговоруНоменклатураПоЗаявкамПредприятий.Номенклатура КАК Номенклатура,
	|	СпецификацияКДоговоруНоменклатураПоЗаявкамПредприятий.Количество КАК Количество
	|ИЗ
	|	Документ.СпецификацияКДоговору.НоменклатураПоЗаявкамПредприятий КАК СпецификацияКДоговоруНоменклатураПоЗаявкамПредприятий
	|ГДЕ
	|	СпецификацияКДоговоруНоменклатураПоЗаявкамПредприятий.Ссылка = &СпецификацияКДоговору
	|	И СпецификацияКДоговоруНоменклатураПоЗаявкамПредприятий.ЗаявкаПредприятия = &ЗаявкаПредприятия";
	
	Запрос.УстановитьПараметр("СпецификацияКДоговору", СпецификацияКДоговору);
	Запрос.УстановитьПараметр("ЗаявкаПредприятия", ЗаявкаПредприятия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
